#!/usr/bin/perl





#
print("\n________________________________ while 循环__________________________________________________\n");
$a = 10;
# 执行 while 循环
while( $a < 20 ){
   printf "a 的值为 : $a\n";
   $a = $a + 1;
}








print("\n________________________________ until 循环__________________________________________________\n");
$a = 5;
# 执行 until 循环
until( $a > 10 ){ #在变量 $a 小于 10 时执行循环体，在变量 $a 大于 10 时，退出循环。
   printf "a 的值为 : $a\n";
   $a = $a + 1;
}







print("\n________________________________ for 循环__________________________________________________\n");
# 执行 for 循环
for( $a = 0; $a < 10; $a = $a + 1 ){
    print "a 的值为: $a\n";
}






print("\n________________________________ foreach 循环__________________________________________________\n");
#foreach 循环用于迭代一个列表或集合变量的值。
@list = (2, 12, 36, 42, 51);
# 执行foreach 循环
foreach $a (@list){
    print "a 的值为: $a\n";
}






print("\n________________________________ do...while 循环__________________________________________________\n");
#do...while 循环是在循环的尾部检查它的条件
$a = 10;
# 执行 do...while 循环
do{
   printf "a 的值为: $a\n";
   $a = $a + 1;
}while( $a < 15 );





=pod
print("\n________________________________循环嵌套__________________________________________________\n");



for ( init; condition; increment ){
   for ( init; condition; increment ){
      statement(s);
   }
   statement(s);
}

=cut

print("\n_______________________________循环控制语句__________________________________________________\n");





