#!/usr/bin/perl 




=pod
	  Perl 中的字符串使用一个标量来表示，
	  定义方式和 c 很像，
	  但是在 Perl 里面字符串不是用 \0 来表示结束的。
	  
	  用单引号定义可以使用多行文本，
	  #TODO 经我测试，双引号也可以。
	  
=cut


#注意：引号和 双引号都可以直接输出多行文本，"只是双引号会转义内容，而单引号不会。"
$var='\n这是一个  使用
多行字符串文本
的例子1';
print($var);

$var2="\n这是一个  使用
多行字符串文本
的例子2";
print($var2);


print "\n_______________________________________________________________________________________________\n";


#会转义
$str = "菜鸟教程  \nwww.runoob.com";
print "$str\n";

#不会转议
$str = '菜鸟教程  \nwww.runoob.com';
print "$str\n";



print "\n_______________________________________________________________________________________________\n";




#转议一个字母为大写
$str = "\urunoob";
print "$str\n";


#转议所有字母为大写
$str = "\Urunoob";
print "$str\n";
 

# \U \E 转议指定部分字母为大写
$str = "Welcome to \Urunoob\E.com!"; 
print "$str\n";

print "\n_______________________________________________________________________________________________\n";




 
# 将到 \E 为止的非单词（non-word）字符加上反斜线
$str = "\QWelcome to runoob's family";
print "$str\n";

print "\n_______________________________________________________________________________________________\n";







