#!/usr/bin/perl
 
print("\n_________________________________引号运算__________________________________________________\n");

=pod
      q{}   #为字符串添加单引号
      qq{}  #为字符串添加双引号
      qx{}  #为字符串添加反引号
=cut


$a = 10;
 
$b = q{a = $a};
print "q{a = \$a} = $b\n";
 
$b = qq{a = $a};
print "qq{a = \$a} = $b\n";
 
$t = qx{date}; # 等效于 $t = `date`;
print "qx{date} = $t\n";


print("\n_________________________________其他运算符__________________________________________________\n");

=pod

      .	连接两个字符串
      x	运算符返回字符串重复的次数。	('-' x 3) 输出为 ---。
      ..	.. 为范围运算符
      ++	自增
      --	自减
      ->	箭号用于指定一个类的方法	$obj->$a 表示对象 $obj 的 $a 方法。

=cut

$a = "run";
$b = "oob";


$c = $a . $b;
print "\$a . \$b = $c\n";



$c = "liheng" x 3;
print "$c"   . "\n";


 
@c = (2..5);
print "(2..5) = @c\n";
 



