#!/usr/bin/perl

print("\n_________________________________算术运算符__________________________________________________\n");
=pod

      +	加法运算	    $a + $b 结果为 30
      -	减法运算	    $a - $b 结果为 -10
      *	乘法运算	    $a * $b 结果为 200
      /	除法运算	    $b / $a 结果为 2
      %	求余运算， 整除后的余数	$b % $a 结果为 0
      **	乘幂	  $a**$b 结果为 10 的 20 次方
=cut

$a = 10;
$b = 20;
 
print "\$a = $a , \$b = $b\n";
 
$c = $a + $b;
print '$a + $b = ' . $c . "\n";
 
$c = $a - $b;
print '$a - $b = ' . $c . "\n";
 
$c = $a * $b;
print '$a * $b = ' . $c . "\n";
 
$c = $a / $b;
print '$a / $b = ' . $c . "\n";
 
$c = $a % $b;
print '$a % $b = ' . $c. "\n";
 
$a = 2;
$b = 4;
$c = $a ** $b;
print '$a ** $b = ' . $c . "\n";


print("\n_________________________________比较运算符(数字)__________________________________________________\n");

=pod
    ==	    检查两个操作数的值是否相等，如果相等则条件为 true，否则为 false。	($a == $b) 为 false
    !=	    检查两个操作数的值是否相等，如果不相等则条件为 true，否则为 false。	($a != $b) 为 true。
    <=>	    检查两个操作数的值是否相等, 如果左边的数小于右边的数返回 -1，如果相等返回 0, 如果左边的数大于右边的数返回 1 。	($a <=> $b) 返回 -1。
    >	      检查左操作数的值是否大于右操作数的值，如果是则条件为 true，否则为 false。	($a > $b) 返回 false。
    <	      检查左操作数的值是否小于右操作数的值，如果是则条件为 true，否则返回 false。	($a < $b) 返回 true。
    >=	  检查左操作数的值是否大于或等于右操作数的值，如果是则条件为 true，否则返回 false。	($a >= $b) 返回 false。
    <=	  检查左操作数的值是否小于或等于右操作数的值，如果是则条件为 true，否则返回 false。
=cut



$a = 10;
$b = 20;
 
print "\$a = $a , \$b = $b\n";
 
if( $a == $b ){
   print "$a == \$b 结果 true\n";
}else{
   print "\$a == \$b 结果 false\n";
}
 
if( $a != $b ){
   print "\$a != \$b 结果 true\n";
}else{
   print "\$a != \$b 结果 false\n";
}
 
$c = $a <=> $b;  #这个相当于java的compareTo 返回   -1 0 1
print "\$a <=> \$b 返回 $c\n";
 
if( $a > $b ){
   print "\$a > \$b 结果 true\n";
}else{
   print "\$a > \$b 结果 false\n";
}
 
if( $a >= $b ){
   print "\$a >= \$b 结果 true\n";
}else{
   print "\$a >= \$b 结果 false\n";
}
 
if( $a < $b ){
   print "\$a < \$b 结果 true\n";
}else{
   print "\$a < \$b 结果 false\n";
}
 
if( $a <= $b ){
   print "\$a <= \$b 结果 true\n";
}else{
   print "\$a <= \$b 结果 false\n";
}

print("\n_________________________________比较运算符(字符串)__________________________________________________\n");



