#!/usr/bin/perl




print("\n___________\$^ (\$FORMAT_TOP_NAME) ：指定表头 __________________________________________________\n"); 

=pod
	 $^ 用来指定表头
=cut

format EMPLOYEE =
======================================
@<<<<<<<<<<<<<<<<<<<<<< @<<
$name, $age
@#####.##
$salary
======================================
.

format EMPLOYEE_TOP =
======================================
Name                    Age
======================================
.

select(STDOUT);
$~ = EMPLOYEE;
$^ = EMPLOYEE_TOP;

@n = ("Ali", "Runoob", "Jaffer");
@a  = (20,30, 40);
@s = (2000.00, 2500.00, 4000.000);
 
$i = 0;
foreach (@n){
   $name = $_;
   $age = $a[$i];
   $salary = $s[$i++];
   write;
}

 



